tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "dunn/emacs"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/science"
tap "homebrew/services"
tap "umiacs/umiacs"
cask "java"
cask "mactex"
brew "ack"
brew "ansifilter"
brew "docbook"
brew "asciidoc"
brew "gdbm"
brew "python3"
brew "asciinema"
brew "asciitex"
brew "aspell"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "cairo"
brew "git"
brew "python"
brew "atk"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bdw-gc"
brew "binutils"
brew "boost"
brew "brew-cask-completion"
brew "bundler-completion"
brew "ccache"
brew "cheat"
brew "checkbashisms"
brew "chrome-cli"
brew "clang-format"
brew "cloc"
brew "cmake", args: ["with-completion"]
brew "colordiff"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "diff-pdf"
brew "diff-so-fancy"
brew "direnv"
brew "dirmngr"
brew "ditaa"
brew "docbook-xsl"
brew "docbook2x"
brew "docker-completion"
brew "dos2unix"
brew "doxygen"
brew "gmp"
brew "gsasl"
brew "emacs", args: ["with-cocoa", "with-librsvg", "with-mailutils", "with-modules"]
brew "ghostscript"
brew "epstool"
brew "exiftool"
brew "faac"
brew "gd"
brew "gnuplot"
brew "feedgnuplot"
brew "gcc"
brew "open-mpi"
brew "fftw", args: ["with-fortran", "with-mpi"]
brew "findutils"
brew "graphviz", args: ["with-app", "with-librsvg", "with-pango", "with-x11"]
brew "ford"
brew "fribidi"
brew "fswatch"
brew "gawk"
brew "gcc@6"
brew "gcovr"
brew "gdb"
brew "gem-completion"
brew "ruby"
brew "ghi"
brew "gibo"
brew "imagemagick", args: ["with-fftw", "with-ghostscript", "with-liblqr", "with-librsvg", "with-openjpeg", "with-openmp", "with-pango", "with-perl", "with-x11", "cc=gcc-7"]
brew "gifify"
brew "giflib"
brew "gifsicle", args: ["with-x11"]
brew "gist"
brew "git-cal"
brew "latexdiff"
brew "git-latexdiff"
brew "git-open"
brew "git-plus"
brew "global", args: ["with-ctags", "with-pygments"]
brew "gnu-barcode"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "go"
brew "googler"
brew "gpg-agent"
brew "graphicsmagick"
brew "hicolor-icon-theme"
brew "gtk+"
brew "gtm"
brew "hadolint"
brew "help2man"
brew "highlight"
brew "hopenpgp-tools"
brew "htop"
brew "hub"
brew "ispell"
brew "jbig2dec"
brew "jenv"
brew "joe"
brew "oniguruma"
brew "jq"
brew "json-c"
brew "launchctl-completion"
brew "libass"
brew "libatomic_ops"
brew "libgit2"
brew "libogg"
brew "libsvg"
brew "libsvg-cairo"
brew "libusb-compat"
brew "libvorbis"
brew "libxmlsec1"
brew "libyubikey"
brew "liquidprompt"
brew "llvm"
brew "lynx"
brew "lzip"
brew "lzlib"
brew "macvim"
brew "make"
brew "makedepend"
brew "markdown"
brew "media-info"
brew "modules"
brew "monkeysphere"
brew "mpich"
brew "nethogs"
brew "ninja"
brew "node"
brew "oath-toolkit"
brew "open-completion"
brew "osxutils"
brew "p7zip"
brew "packer"
brew "packer-completion"
brew "pandoc"
brew "paperkey"
brew "patchutils"
brew "pdf2svg"
brew "pdfgrep"
brew "pdflib-lite"
brew "pgplot"
brew "pip-completion"
brew "plantuml"
brew "plotutils"
brew "plplot"
brew "pstoedit"
brew "py2cairo"
brew "pygobject"
brew "pygtk"
brew "pyqt"
brew "qrencode"
brew "rename"
brew "rmtrash"
brew "ruby-completion"
brew "scons"
brew "sha1dc"
brew "shellcheck"
brew "shfmt"
brew "shpotify"
brew "source-highlight"
brew "ssh-copy-id"
brew "stow"
brew "subversion"
brew "svg2pdf"
brew "swig"
brew "syncthing"
brew "texi2html"
brew "texinfo"
brew "texmath"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tree"
brew "vagrant-completion"
brew "valgrind"
brew "vassh"
brew "vim"
brew "w3m"
brew "warp"
brew "watch"
brew "watchman"
brew "wget"
brew "xdot"
brew "yasm"
brew "ykpers"
brew "yuicompressor"
brew "zbar"
brew "dunn/emacs/async-emacs"
brew "dunn/emacs/cl-lib"
brew "dunn/emacs/dockerfile-mode"
brew "dunn/emacs/magit"
brew "dunn/emacs/pdf-tools"
brew "homebrew/science/ascii_plots"
brew "homebrew/science/butterflow"
brew "homebrew/science/h5utils"
brew "homebrew/science/hwloc"
brew "homebrew/science/metis"
brew "homebrew/science/nfft"
brew "homebrew/science/openblas"
brew "homebrew/science/paraview"
brew "homebrew/science/parmetis"
brew "homebrew/science/r"
brew "homebrew/science/scalapack"
brew "umiacs/umiacs/umobj"
cask "argouml"
cask "betterzipql"
cask "black-screen"
cask "cmake"
cask "dhs"
cask "docker"
cask "docker-toolbox"
cask "emacs"
cask "firefox-esr"
cask "google-web-designer"
cask "gpgtools"
cask "hyper"
cask "imagealpha"
cask "iterm2"
cask "java7"
cask "kextviewr"
cask "knockknock"
cask "multifirefox"
cask "multimarkdown-composer"
cask "osxfuse"
cask "pdfinfo"
cask "pdfshaver"
cask "plotdigitizer"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "qr-journal"
cask "quicklook-csv"
cask "quicklook-json"
cask "ransomwhere"
cask "silverlight"
cask "skim"
cask "suspicious-package"
cask "taskexplorer"
cask "tidal"
cask "torbrowser"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "webpquicklook"
cask "yed"
