tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "dunn/emacs"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/science"
tap "homebrew/services"
tap "umiacs/umiacs"
tap "vitorgalvao/tiny-scripts"
cask "java"
cask "xquartz"
brew "ack"
brew "aria2"
brew "fc"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "cairo"
brew "perl"
brew "git"
brew "gdbm"
brew "pkg-config"
brew "sqlite"
brew "python"
brew "python3"
brew "adwaita-icon-theme"
brew "aircrack-ng"
brew "ansifilter"
brew "docbook"
brew "asciidoc"
brew "asciinema"
brew "gifsicle"
brew "libtool"
brew "imagemagick"
brew "phantomjs"
brew "asciinema2gif"
brew "asciitex"
brew "aspell"
brew "atk"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bdw-gc"
brew "binutils"
brew "boost"
brew "brew-cask-completion"
brew "bundler-completion"
brew "ccache"
brew "ccat"
brew "cheat"
brew "checkbashisms"
brew "chrome-cli"
brew "clang-format"
brew "cloc"
brew "cmake", args: ["with-completion"]
brew "gmp@4"
brew "isl@0.12"
brew "cloog"
brew "colordiff"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "diff-pdf"
brew "diff-so-fancy"
brew "direnv"
brew "dirmngr"
brew "ditaa"
brew "docbook-xsl"
brew "docbook2x"
brew "docker-completion"
brew "dos2unix"
brew "doxygen"
brew "duti"
brew "gmp"
brew "nettle"
brew "gsasl"
brew "emacs", args: ["with-cocoa", "with-librsvg", "with-mailutils", "with-modules"]
brew "emojify"
brew "ghostscript"
brew "epstool"
brew "libxml2"
brew "evince"
brew "exercism"
brew "exiftool"
brew "faac"
brew "fastjar"
brew "gd"
brew "gnuplot"
brew "feedgnuplot"
brew "isl"
brew "mpfr"
brew "gcc"
brew "libevent"
brew "open-mpi"
brew "fftw", args: ["with-fortran", "with-mpi"]
brew "findutils"
brew "fobis"
brew "ford"
brew "fribidi"
brew "fswatch"
brew "gawk"
brew "mpfr@2"
brew "libmpc@0.8"
brew "gcc@4.9"
brew "isl@0.14"
brew "gcc@5"
brew "gcc@6"
brew "gcovr"
brew "gdb"
brew "gem-completion"
brew "libyaml"
brew "rclone"
brew "ruby"
brew "ghi"
brew "gibo"
brew "gifify"
brew "giflib"
brew "gist"
brew "git-cal"
brew "git-open"
brew "git-plus"
brew "global", args: ["with-ctags", "with-pygments"]
brew "gnu-barcode"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "pkcs11-helper"
brew "gnupg-pkcs11-scd"
brew "go"
brew "googler"
brew "gpg-agent"
brew "gprof2dot"
brew "grip"
brew "gtk+"
brew "guile"
brew "hadolint"
brew "hdf5"
brew "help2man"
brew "heroku"
brew "highlight"
brew "hopenpgp-tools"
brew "hr"
brew "htop"
brew "hub"
brew "hwloc"
brew "ispell"
brew "jbig2dec"
brew "jenv"
brew "jfrog-cli-go"
brew "jid"
brew "jpegoptim"
brew "jq"
brew "jsawk"
brew "lasi"
brew "latex2html"
brew "latex2rtf"
brew "latexml"
brew "launchctl-completion"
brew "libass"
brew "libatomic_ops"
brew "libelf"
brew "libgit2"
brew "libogg"
brew "libsvg"
brew "libsvg-cairo"
brew "libusb-compat"
brew "yajl"
brew "libvirt"
brew "libvorbis"
brew "libxmlsec1"
brew "libyubikey"
brew "liquidprompt"
brew "llvm"
brew "lynx"
brew "lzip"
brew "lzlib"
brew "macvim"
brew "magic-wormhole"
brew "make"
brew "makedepend"
brew "markdown"
brew "mas"
brew "media-info"
brew "metis"
brew "mobile-shell"
brew "modules"
brew "monkeysphere"
brew "mono"
brew "mpich", args: ["HEAD"]
brew "ninja"
brew "numpy"
brew "oath-toolkit"
brew "open-completion"
brew "openblas"
brew "opencv"
brew "opencv@2"
brew "osxutils"
brew "p7zip"
brew "packer"
brew "packer-completion"
brew "pandoc"
brew "paperkey"
brew "patchutils"
brew "pdf2svg"
brew "pdfgrep"
brew "pdflib-lite"
brew "pgplot"
brew "pip-completion"
brew "plantuml"
brew "plotutils"
brew "plplot"
brew "pngnq"
brew "pngquant"
brew "progress"
brew "pstoedit"
brew "pv"
brew "py2cairo"
brew "pygobject"
brew "pygtk"
brew "pyqt"
brew "qhull"
brew "qpdf"
brew "qrencode"
brew "r"
brew "rbenv"
brew "rename"
brew "rmtrash"
brew "ruby-completion"
brew "ruby-install"
brew "rust"
brew "veclibfort"
brew "scalapack"
brew "scons"
brew "sha1dc"
brew "shellcheck"
brew "shfmt"
brew "shpotify"
brew "source-highlight"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "stow"
brew "subversion"
brew "svg2pdf"
brew "swig"
brew "syncthing"
brew "tectonic"
brew "texi2html"
brew "texinfo"
brew "texmath"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tree"
brew "unrar"
brew "vagrant-completion"
brew "valgrind"
brew "vassh"
brew "vim"
brew "w3m"
brew "warp"
brew "watch"
brew "watchman"
brew "wego"
brew "wget"
brew "whois"
brew "xclip"
brew "xdot"
brew "yarn"
brew "yasm"
brew "ykpers"
brew "yubico-piv-tool"
brew "yuicompressor"
brew "zbar"
brew "zlib"
brew "dunn/emacs/async-emacs"
brew "dunn/emacs/let-alist"
brew "dunn/emacs/dash-emacs"
brew "dunn/emacs/popup"
brew "dunn/emacs/auto-complete"
brew "dunn/emacs/cl-lib"
brew "dunn/emacs/dockerfile-mode"
brew "dunn/emacs/magit"
brew "dunn/emacs/tablist"
brew "dunn/emacs/pdf-tools"
brew "homebrew/science/ascii_plots"
brew "homebrew/science/butterflow"
brew "homebrew/science/h5utils"
brew "homebrew/science/mathomatic"
brew "homebrew/science/nfft"
brew "homebrew/science/paraview"
brew "homebrew/science/parmetis"
brew "umiacs/umiacs/umobj"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "adobe-acrobat-reader"
cask "amidst"
cask "anylist"
cask "argouml"
cask "asciidocfx"
cask "betterzipql"
cask "ccmenu"
cask "cmake"
cask "dhs"
cask "docker"
cask "dropbox"
cask "droplr"
cask "emacs"
cask "fuse"
cask "gimp"
cask "gitter"
cask "google-chrome"
cask "google-hangouts"
cask "google-web-designer"
cask "gpgtools"
cask "hyper"
cask "imagealpha"
cask "imageoptim"
cask "kextviewr"
cask "keybase"
cask "knockknock"
cask "macdependency"
cask "mactex"
cask "multifirefox"
cask "osxfuse"
cask "pdf-images"
cask "pdfinfo"
cask "pdfsam-basic"
cask "pdfshaver"
cask "plotdigitizer"
cask "pngyu"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "qr-journal"
cask "quicklook-csv"
cask "quicklook-json"
cask "screenhero"
cask "silverlight"
cask "skim"
cask "skype"
cask "slack"
cask "suspicious-package"
cask "taskexplorer"
cask "tidal"
cask "transmission"
cask "unison"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "webpquicklook"
cask "wireshark"
cask "yed"
cask "caskroom/drivers/yubico-authenticator"
cask "caskroom/drivers/yubikey-personalization-gui"
cask "caskroom/drivers/yubikey-piv-manager"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/versions/firefox-esr"
cask "caskroom/versions/iterm2-beta"
cask "caskroom/versions/java8"
mas "CCMenu", id: 603117688
mas "Disk Aid", id: 1007358832
mas "Disk Doctor", id: 455970963
mas "Duplicate Detective", id: 686428787
mas "Install OS X El Capitan", id: 1018109117
mas "JPEGmini", id: 498944723
mas "Stockfish", id: 801463932
mas "Xcode", id: 497799835
mas "xDiagram", id: 517581636
