tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "dunn/emacs"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/science"
tap "homebrew/services"
tap "node_modules/.bin"
tap "node_modules/abbrev"
tap "node_modules/agent-base"
tap "node_modules/agentkeepalive"
tap "node_modules/ajv"
tap "node_modules/ansi-align"
tap "node_modules/ansi-regex"
tap "node_modules/ansi-styles"
tap "node_modules/ansicolors"
tap "node_modules/ansistyles"
tap "node_modules/aproba"
tap "node_modules/archy"
tap "node_modules/are-we-there-yet"
tap "node_modules/asap"
tap "node_modules/asn1"
tap "node_modules/assert-plus"
tap "node_modules/asynckit"
tap "node_modules/aws-sign2"
tap "node_modules/aws4"
tap "node_modules/balanced-match"
tap "node_modules/bcrypt-pbkdf"
tap "node_modules/bl"
tap "node_modules/block-stream"
tap "node_modules/bluebird"
tap "node_modules/boom"
tap "node_modules/boxen"
tap "node_modules/brace-expansion"
tap "node_modules/builtin-modules"
tap "node_modules/builtins"
tap "node_modules/cacache"
tap "node_modules/call-limit"
tap "node_modules/camelcase"
tap "node_modules/capture-stack-trace"
tap "node_modules/caseless"
tap "node_modules/chalk"
tap "node_modules/chownr"
tap "node_modules/cli-boxes"
tap "node_modules/clone"
tap "node_modules/cmd-shim"
tap "node_modules/co"
tap "node_modules/code-point-at"
tap "node_modules/columnify"
tap "node_modules/combined-stream"
tap "node_modules/concat-map"
tap "node_modules/concat-stream"
tap "node_modules/config-chain"
tap "node_modules/configstore"
tap "node_modules/console-control-strings"
tap "node_modules/copy-concurrently"
tap "node_modules/core-util-is"
tap "node_modules/create-error-class"
tap "node_modules/cross-spawn-async"
tap "node_modules/cryptiles"
tap "node_modules/crypto-random-string"
tap "node_modules/cyclist"
tap "node_modules/dashdash"
tap "node_modules/debug"
tap "node_modules/debuglog"
tap "node_modules/deep-extend"
tap "node_modules/defaults"
tap "node_modules/delayed-stream"
tap "node_modules/delegates"
tap "node_modules/detect-indent"
tap "node_modules/dezalgo"
tap "node_modules/dot-prop"
tap "node_modules/duplexer3"
tap "node_modules/duplexify"
tap "node_modules/ecc-jsbn"
tap "node_modules/editor"
tap "node_modules/encoding"
tap "node_modules/end-of-stream"
tap "node_modules/err-code"
tap "node_modules/escape-string-regexp"
tap "node_modules/execa"
tap "node_modules/extend"
tap "node_modules/extsprintf"
tap "node_modules/flush-write-stream"
tap "node_modules/forever-agent"
tap "node_modules/form-data"
tap "node_modules/from2"
tap "node_modules/fs-vacuum"
tap "node_modules/fs-write-stream-atomic"
tap "node_modules/fs.realpath"
tap "node_modules/fstream"
tap "node_modules/fstream-ignore"
tap "node_modules/fstream-npm"
tap "node_modules/gauge"
tap "node_modules/genfun"
tap "node_modules/get-stream"
tap "node_modules/getpass"
tap "node_modules/glob"
tap "node_modules/got"
tap "node_modules/graceful-fs"
tap "node_modules/har-schema"
tap "node_modules/har-validator"
tap "node_modules/has-ansi"
tap "node_modules/has-unicode"
tap "node_modules/hawk"
tap "node_modules/hoek"
tap "node_modules/hosted-git-info"
tap "node_modules/http-cache-semantics"
tap "node_modules/http-proxy-agent"
tap "node_modules/http-signature"
tap "node_modules/https-proxy-agent"
tap "node_modules/humanize-ms"
tap "node_modules/iconv-lite"
tap "node_modules/iferr"
tap "node_modules/imurmurhash"
tap "node_modules/inflight"
tap "node_modules/inherits"
tap "node_modules/ini"
tap "node_modules/init-package-json"
tap "node_modules/ip"
tap "node_modules/is-builtin-module"
tap "node_modules/is-fullwidth-code-point"
tap "node_modules/is-npm"
tap "node_modules/is-obj"
tap "node_modules/is-redirect"
tap "node_modules/is-retry-allowed"
tap "node_modules/is-stream"
tap "node_modules/is-typedarray"
tap "node_modules/isarray"
tap "node_modules/isexe"
tap "node_modules/isstream"
tap "node_modules/jju"
tap "node_modules/jodid25519"
tap "node_modules/jsbn"
tap "node_modules/json-parse-helpfulerror"
tap "node_modules/json-schema"
tap "node_modules/json-stable-stringify"
tap "node_modules/json-stringify-safe"
tap "node_modules/jsonify"
tap "node_modules/jsonparse"
tap "node_modules/jsonstream"
tap "node_modules/jsprim"
tap "node_modules/latest-version"
tap "node_modules/lazy-property"
tap "node_modules/lazy-req"
tap "node_modules/lockfile"
tap "node_modules/lodash._baseindexof"
tap "node_modules/lodash._baseuniq"
tap "node_modules/lodash._bindcallback"
tap "node_modules/lodash._cacheindexof"
tap "node_modules/lodash._createcache"
tap "node_modules/lodash._createset"
tap "node_modules/lodash._getnative"
tap "node_modules/lodash._root"
tap "node_modules/lodash.clonedeep"
tap "node_modules/lodash.restparam"
tap "node_modules/lodash.union"
tap "node_modules/lodash.uniq"
tap "node_modules/lodash.without"
tap "node_modules/lowercase-keys"
tap "node_modules/lru-cache"
tap "node_modules/make-fetch-happen"
tap "node_modules/mime-db"
tap "node_modules/mime-types"
tap "node_modules/minimatch"
tap "node_modules/minimist"
tap "node_modules/mississippi"
tap "node_modules/mkdirp"
tap "node_modules/move-concurrently"
tap "node_modules/ms"
tap "node_modules/mute-stream"
tap "node_modules/node-fetch-npm"
tap "node_modules/node-gyp"
tap "node_modules/nopt"
tap "node_modules/normalize-package-data"
tap "node_modules/npm"
tap "node_modules/npm-cache-filename"
tap "node_modules/npm-install-checks"
tap "node_modules/npm-package-arg"
tap "node_modules/npm-pick-manifest"
tap "node_modules/npm-registry-client"
tap "node_modules/npm-run-path"
tap "node_modules/npm-user-validate"
tap "node_modules/npmlog"
tap "node_modules/number-is-nan"
tap "node_modules/oauth-sign"
tap "node_modules/object-assign"
tap "node_modules/once"
tap "node_modules/opener"
tap "node_modules/os-homedir"
tap "node_modules/os-tmpdir"
tap "node_modules/osenv"
tap "node_modules/package-json"
tap "node_modules/pacote"
tap "node_modules/parallel-transform"
tap "node_modules/path-is-absolute"
tap "node_modules/path-is-inside"
tap "node_modules/path-key"
tap "node_modules/performance-now"
tap "node_modules/prepend-http"
tap "node_modules/process-nextick-args"
tap "node_modules/promise-inflight"
tap "node_modules/promise-retry"
tap "node_modules/promzard"
tap "node_modules/proto-list"
tap "node_modules/protoduck"
tap "node_modules/pseudomap"
tap "node_modules/pump"
tap "node_modules/pumpify"
tap "node_modules/punycode"
tap "node_modules/qs"
tap "node_modules/rc"
tap "node_modules/read"
tap "node_modules/read-cmd-shim"
tap "node_modules/read-installed"
tap "node_modules/read-package-json"
tap "node_modules/read-package-tree"
tap "node_modules/readable-stream"
tap "node_modules/readdir-scoped-modules"
tap "node_modules/registry-auth-token"
tap "node_modules/registry-url"
tap "node_modules/request"
tap "node_modules/retry"
tap "node_modules/rimraf"
tap "node_modules/run-queue"
tap "node_modules/safe-buffer"
tap "node_modules/semver"
tap "node_modules/semver-diff"
tap "node_modules/set-blocking"
tap "node_modules/sha"
tap "node_modules/signal-exit"
tap "node_modules/slide"
tap "node_modules/smart-buffer"
tap "node_modules/sntp"
tap "node_modules/socks"
tap "node_modules/socks-proxy-agent"
tap "node_modules/sorted-object"
tap "node_modules/sorted-union-stream"
tap "node_modules/spdx-correct"
tap "node_modules/spdx-expression-parse"
tap "node_modules/spdx-license-ids"
tap "node_modules/sshpk"
tap "node_modules/ssri"
tap "node_modules/stream-each"
tap "node_modules/stream-iterate"
tap "node_modules/stream-shift"
tap "node_modules/string-width"
tap "node_modules/string_decoder"
tap "node_modules/stringstream"
tap "node_modules/strip-ansi"
tap "node_modules/strip-eof"
tap "node_modules/strip-json-comments"
tap "node_modules/supports-color"
tap "node_modules/tar"
tap "node_modules/tar-fs"
tap "node_modules/tar-stream"
tap "node_modules/term-size"
tap "node_modules/text-table"
tap "node_modules/through"
tap "node_modules/through2"
tap "node_modules/timed-out"
tap "node_modules/tough-cookie"
tap "node_modules/tunnel-agent"
tap "node_modules/tweetnacl"
tap "node_modules/typedarray"
tap "node_modules/uid-number"
tap "node_modules/umask"
tap "node_modules/unique-filename"
tap "node_modules/unique-slug"
tap "node_modules/unique-string"
tap "node_modules/unpipe"
tap "node_modules/unzip-response"
tap "node_modules/update-notifier"
tap "node_modules/url-parse-lax"
tap "node_modules/util-deprecate"
tap "node_modules/util-extend"
tap "node_modules/uuid"
tap "node_modules/validate-npm-package-license"
tap "node_modules/validate-npm-package-name"
tap "node_modules/verror"
tap "node_modules/wcwidth"
tap "node_modules/which"
tap "node_modules/wide-align"
tap "node_modules/widest-line"
tap "node_modules/wrappy"
tap "node_modules/write-file-atomic"
tap "node_modules/xdg-basedir"
tap "node_modules/xtend"
tap "node_modules/y18n"
tap "node_modules/yallist"
tap "umiacs/umiacs"
cask "java"
cask "mactex"
brew "ack"
brew "ansifilter"
brew "docbook"
brew "asciidoc"
brew "gdbm"
brew "asciinema"
brew "asciitex"
brew "aspell"
brew "gettext"
brew "cairo"
brew "git"
brew "pkg-config"
brew "atk"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bdw-gc"
brew "binutils"
brew "boost"
brew "brew-cask-completion"
brew "bundler-completion"
brew "ccache"
brew "ccat"
brew "checkbashisms"
brew "chrome-cli"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "python"
brew "diff-pdf"
brew "diff-so-fancy"
brew "direnv"
brew "dirmngr"
brew "ditaa"
brew "docbook-xsl"
brew "docbook2x"
brew "docker-completion"
brew "dos2unix"
brew "doxygen"
brew "gmp"
brew "gsasl"
brew "graphite2"
brew "libtasn1"
brew "emacs", args: ["with-cocoa", "with-librsvg", "with-mailutils", "with-modules"]
brew "emojify"
brew "ghostscript"
brew "epstool"
brew "exercism"
brew "exiftool"
brew "faac"
brew "gd"
brew "gnuplot"
brew "feedgnuplot"
brew "gcc"
brew "open-mpi"
brew "fftw", args: ["with-fortran", "with-mpi"]
brew "findutils"
brew "graphviz", args: ["with-app", "with-librsvg", "with-pango", "with-x11"]
brew "ford"
brew "fribidi"
brew "fswatch"
brew "gawk"
brew "gcc@4.6"
brew "gcc@5"
brew "gcc@6"
brew "gcovr"
brew "gdb"
brew "gem-completion"
brew "gibo"
brew "imagemagick"
brew "gifify"
brew "giflib"
brew "gifsicle", args: ["with-x11"]
brew "gist"
brew "git-cal"
brew "latexdiff"
brew "git-latexdiff"
brew "git-open"
brew "git-plus"
brew "global", args: ["with-ctags", "with-pygments"]
brew "gnu-barcode"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "gnutls"
brew "go"
brew "googler"
brew "gpg-agent"
brew "graphicsmagick"
brew "hicolor-icon-theme"
brew "gtk+"
brew "gtm"
brew "hadolint"
brew "hdf5"
brew "help2man"
brew "heroku"
brew "highlight"
brew "hopenpgp-tools"
brew "htop"
brew "hub"
brew "hwloc"
brew "ispell"
brew "jbig2dec"
brew "jenv"
brew "joe"
brew "oniguruma"
brew "jq"
brew "json-c"
brew "lasi"
brew "launchctl-completion"
brew "libass"
brew "libatomic_ops"
brew "libelf"
brew "libgit2"
brew "libogg"
brew "libsvg"
brew "libsvg-cairo"
brew "libusb-compat"
brew "libvorbis"
brew "libxmlsec1"
brew "libyubikey"
brew "liquidprompt"
brew "llvm"
brew "lynx"
brew "lzip"
brew "lzlib"
brew "macvim"
brew "make"
brew "makedepend"
brew "markdown"
brew "media-info"
brew "metis"
brew "modules"
brew "monkeysphere"
brew "mpich"
brew "netcdf"
brew "nethogs"
brew "ninja"
brew "numpy"
brew "oath-toolkit"
brew "open-completion"
brew "openblas"
brew "opencv"
brew "osxutils"
brew "p7zip"
brew "packer"
brew "packer-completion"
brew "pandoc"
brew "paperkey"
brew "patchutils"
brew "pdf2svg"
brew "pdfgrep"
brew "pdflib-lite"
brew "pgplot"
brew "pip-completion"
brew "plantuml"
brew "plotutils"
brew "plplot"
brew "progress"
brew "pstoedit"
brew "pv"
brew "py2cairo"
brew "pygobject"
brew "pygtk"
brew "pyqt"
brew "qhull"
brew "qrencode"
brew "r"
brew "rbenv"
brew "rename"
brew "rmtrash"
brew "ruby"
brew "ruby-completion"
brew "ruby-install"
brew "rust"
brew "veclibfort"
brew "scalapack"
brew "scons"
brew "sha1dc"
brew "shellcheck"
brew "shfmt"
brew "shpotify"
brew "source-highlight"
brew "ssh-copy-id"
brew "stow"
brew "subversion"
brew "svg2pdf"
brew "swig"
brew "syncthing"
brew "texi2html"
brew "texinfo"
brew "texmath"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tree"
brew "vagrant-completion"
brew "valgrind"
brew "vassh"
brew "vim"
brew "w3m"
brew "warp"
brew "watch"
brew "watchman"
brew "wego"
brew "wget"
brew "xdot"
brew "yasm"
brew "ykpers"
brew "yuicompressor"
brew "zbar"
brew "zlib"
brew "dunn/emacs/async-emacs"
brew "dunn/emacs/cl-lib"
brew "dunn/emacs/dockerfile-mode"
brew "dunn/emacs/magit"
brew "dunn/emacs/pdf-tools"
brew "homebrew/science/ascii_plots"
brew "homebrew/science/butterflow"
brew "homebrew/science/h5utils"
brew "homebrew/science/mathomatic"
brew "homebrew/science/nfft"
brew "homebrew/science/paraview"
brew "homebrew/science/parmetis"
brew "umiacs/umiacs/umobj"
cask "anylist"
cask "argouml"
cask "asciidocfx"
cask "betterzipql"
cask "black-screen"
cask "cmake"
cask "daisydisk"
cask "dhs"
cask "docker"
cask "emacs"
cask "firefox-esr"
cask "font-fira-code"
cask "google-web-designer"
cask "gpgtools"
cask "hyper"
cask "imagealpha"
cask "iterm2"
cask "iterm2-beta"
cask "java7"
cask "kextviewr"
cask "keybase"
cask "knockknock"
cask "macdependency"
cask "miniconda"
cask "multifirefox"
cask "multimarkdown-composer"
cask "now"
cask "osxfuse"
cask "pdfinfo"
cask "pdfshaver"
cask "plotdigitizer"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "qr-journal"
cask "quicklook-csv"
cask "quicklook-json"
cask "ransomwhere"
cask "silverlight"
cask "skim"
cask "suspicious-package"
cask "taskexplorer"
cask "tidal"
cask "torbrowser"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "webpquicklook"
cask "yed"
